grevaillot/svd_tools/headers/STM32L4R7/rcc.h
#define RCC_CFGR_PPRE1_SHIFT		8
#define RCC_CFGR_PPRE1_MASK		0x07
/** @defgroup rcc_cfgr_ppre1 PPRE1 PB low-speed prescaler (APB1)
@{*/
/**@}*/


#define RCC_CFGR_HPRE_SHIFT		4
#define RCC_CFGR_HPRE_MASK		0x0f
/** @defgroup rcc_cfgr_hpre HPRE AHB prescaler
@{*/
/**@}*/


#define RCC_CFGR_SWS_SHIFT		2
#define RCC_CFGR_SWS_MASK		0x03
/** @defgroup rcc_cfgr_sws SWS System clock switch status
@{*/
/**@}*/


#define RCC_CFGR_SW_SHIFT		0
#define RCC_CFGR_SW_MASK		0x03
/** @defgroup rcc_cfgr_sw SW System clock switch
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_pllcfgr PLLCFGR PLL configuration register
@{*/


#define RCC_PLLCFGR_PLLPDIV_SHIFT		27
#define RCC_PLLCFGR_PLLPDIV_MASK		0x1f
/** @defgroup rcc_pllcfgr_pllpdiv PLLPDIV Main PLL division factor for PLLSAI2CLK
@{*/
/**@}*/


#define RCC_PLLCFGR_PLLR_SHIFT		25
#define RCC_PLLCFGR_PLLR_MASK		0x03
/** @defgroup rcc_pllcfgr_pllr PLLR Main PLL division factor for PLLCLK (system clock)
@{*/
/**@}*/

/** RCC_PLLCFGR_PLLREN Main PLL PLLCLK output enable **/
#define RCC_PLLCFGR_PLLREN		(1 << 24)

#define RCC_PLLCFGR_PLLQ_SHIFT		21
#define RCC_PLLCFGR_PLLQ_MASK		0x03
/** @defgroup rcc_pllcfgr_pllq PLLQ Main PLL division factor for PLLUSB1CLK(48 MHz clock)
@{*/
/**@}*/

/** RCC_PLLCFGR_PLLQEN Main PLL PLLUSB1CLK output enable **/
#define RCC_PLLCFGR_PLLQEN		(1 << 20)
/** RCC_PLLCFGR_PLLP Main PLL division factor for PLLSAI3CLK (SAI1 and SAI2 clock) **/
#define RCC_PLLCFGR_PLLP		(1 << 17)
/** RCC_PLLCFGR_PLLPEN Main PLL PLLSAI3CLK output enable **/
#define RCC_PLLCFGR_PLLPEN		(1 << 16)

#define RCC_PLLCFGR_PLLN_SHIFT		8
#define RCC_PLLCFGR_PLLN_MASK		0x7f
/** @defgroup rcc_pllcfgr_plln PLLN Main PLL multiplication factor for VCO
@{*/
/**@}*/


#define RCC_PLLCFGR_PLLM_SHIFT		4
#define RCC_PLLCFGR_PLLM_MASK		0x0f
/** @defgroup rcc_pllcfgr_pllm PLLM Division factor for the main PLL and audio PLL (PLLSAI1 and PLLSAI2) input clock
@{*/
/**@}*/


#define RCC_PLLCFGR_PLLSRC_SHIFT		0
#define RCC_PLLCFGR_PLLSRC_MASK		0x03
/** @defgroup rcc_pllcfgr_pllsrc PLLSRC Main PLL, PLLSAI1 and PLLSAI2 entry clock source
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_pllsai1cfgr PLLSAI1CFGR PLLSAI1 configuration register
@{*/


#define RCC_PLLSAI1CFGR_PLLSAI1PDIV_SHIFT		27
#define RCC_PLLSAI1CFGR_PLLSAI1PDIV_MASK		0x1f
/** @defgroup rcc_pllsai1cfgr_pllsai1pdiv PLLSAI1PDIV PLLSAI1 division factor for PLLSAI1CLK
@{*/
/**@}*/


#define RCC_PLLSAI1CFGR_PLLSAI1R_SHIFT		25
#define RCC_PLLSAI1CFGR_PLLSAI1R_MASK		0x03
/** @defgroup rcc_pllsai1cfgr_pllsai1r PLLSAI1R PLLSAI1 division factor for PLLADC1CLK (ADC clock)
@{*/
/**@}*/

/** RCC_PLLSAI1CFGR_PLLSAI1REN PLLSAI1 PLLADC1CLK output enable **/
#define RCC_PLLSAI1CFGR_PLLSAI1REN		(1 << 24)

#define RCC_PLLSAI1CFGR_PLLSAI1Q_SHIFT		21
#define RCC_PLLSAI1CFGR_PLLSAI1Q_MASK		0x03
/** @defgroup rcc_pllsai1cfgr_pllsai1q PLLSAI1Q SAI1PLL division factor for PLLUSB2CLK (48 MHz clock)
@{*/
/**@}*/

/** RCC_PLLSAI1CFGR_PLLSAI1QEN SAI1PLL PLLUSB2CLK output enable **/
#define RCC_PLLSAI1CFGR_PLLSAI1QEN		(1 << 20)
/** RCC_PLLSAI1CFGR_PLLSAI1P SAI1PLL division factor for PLLSAI1CLK (SAI1 or SAI2 clock) **/
#define RCC_PLLSAI1CFGR_PLLSAI1P		(1 << 17)
/** RCC_PLLSAI1CFGR_PLLSAI1PEN SAI1PLL PLLSAI1CLK output enable **/
#define RCC_PLLSAI1CFGR_PLLSAI1PEN		(1 << 16)

#define RCC_PLLSAI1CFGR_PLLSAI1N_SHIFT		8
#define RCC_PLLSAI1CFGR_PLLSAI1N_MASK		0x7f
/** @defgroup rcc_pllsai1cfgr_pllsai1n PLLSAI1N SAI1PLL multiplication factor for VCO
@{*/
/**@}*/


#define RCC_PLLSAI1CFGR_PLLSAI1M_SHIFT		4
#define RCC_PLLSAI1CFGR_PLLSAI1M_MASK		0x0f
/** @defgroup rcc_pllsai1cfgr_pllsai1m PLLSAI1M Division factor for PLLSAI1 input clock
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_pllsai2cfgr PLLSAI2CFGR PLLSAI2 configuration register
@{*/


#define RCC_PLLSAI2CFGR_PLLSAI2PDIV_SHIFT		27
#define RCC_PLLSAI2CFGR_PLLSAI2PDIV_MASK		0x1f
/** @defgroup rcc_pllsai2cfgr_pllsai2pdiv PLLSAI2PDIV PLLSAI2 division factor for PLLSAI2CLK
@{*/
/**@}*/


#define RCC_PLLSAI2CFGR_PLLSAI2R_SHIFT		25
#define RCC_PLLSAI2CFGR_PLLSAI2R_MASK		0x03
/** @defgroup rcc_pllsai2cfgr_pllsai2r PLLSAI2R PLLSAI2 division factor for PLLADC2CLK (ADC clock)
@{*/
/**@}*/

/** RCC_PLLSAI2CFGR_PLLSAI2REN PLLSAI2 PLLADC2CLK output enable **/
#define RCC_PLLSAI2CFGR_PLLSAI2REN		(1 << 24)

#define RCC_PLLSAI2CFGR_PLLSAI2Q_SHIFT		21
#define RCC_PLLSAI2CFGR_PLLSAI2Q_MASK		0x03
/** @defgroup rcc_pllsai2cfgr_pllsai2q PLLSAI2Q SAI2PLL PLLSAI2CLK output enable
@{*/
/**@}*/

/** RCC_PLLSAI2CFGR_PLLSAI2QEN PLLSAI2 division factor for PLLDISCLK **/
#define RCC_PLLSAI2CFGR_PLLSAI2QEN		(1 << 20)
/** RCC_PLLSAI2CFGR_PLLSAI2P SAI1PLL division factor for PLLSAI2CLK (SAI1 or SAI2 clock) **/
#define RCC_PLLSAI2CFGR_PLLSAI2P		(1 << 17)
/** RCC_PLLSAI2CFGR_PLLSAI2PEN SAI2PLL PLLSAI2CLK output enable **/
#define RCC_PLLSAI2CFGR_PLLSAI2PEN		(1 << 16)

#define RCC_PLLSAI2CFGR_PLLSAI2N_SHIFT		8
#define RCC_PLLSAI2CFGR_PLLSAI2N_MASK		0x7f
/** @defgroup rcc_pllsai2cfgr_pllsai2n PLLSAI2N SAI2PLL multiplication factor for VCO
@{*/
/**@}*/


#define RCC_PLLSAI2CFGR_PLLSAI2M_SHIFT		4
#define RCC_PLLSAI2CFGR_PLLSAI2M_MASK		0x0f
/** @defgroup rcc_pllsai2cfgr_pllsai2m PLLSAI2M Division factor for PLLSAI2 input clock
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_cier CIER Clock interrupt enable register
@{*/

/** RCC_CIER_HSI48RDYIE HSI48 ready interrupt enable **/
#define RCC_CIER_HSI48RDYIE		(1 << 10)
/** RCC_CIER_LSECSSIE LSE clock security system interrupt enable **/
#define RCC_CIER_LSECSSIE		(1 << 9)
/** RCC_CIER_PLLSAI2RDYIE PLLSAI2 ready interrupt enable **/
#define RCC_CIER_PLLSAI2RDYIE		(1 << 7)
/** RCC_CIER_PLLSAI1RDYIE PLLSAI1 ready interrupt enable **/
#define RCC_CIER_PLLSAI1RDYIE		(1 << 6)
/** RCC_CIER_PLLRDYIE PLL ready interrupt enable **/
#define RCC_CIER_PLLRDYIE		(1 << 5)
/** RCC_CIER_HSERDYIE HSE ready interrupt enable **/
#define RCC_CIER_HSERDYIE		(1 << 4)
/** RCC_CIER_HSIRDYIE HSI ready interrupt enable **/
#define RCC_CIER_HSIRDYIE		(1 << 3)
/** RCC_CIER_MSIRDYIE MSI ready interrupt enable **/
#define RCC_CIER_MSIRDYIE		(1 << 2)
/** RCC_CIER_LSERDYIE LSE ready interrupt enable **/
#define RCC_CIER_LSERDYIE		(1 << 1)
/** RCC_CIER_LSIRDYIE LSI ready interrupt enable **/
#define RCC_CIER_LSIRDYIE		(1 << 0)

/**@}*/

/** @defgroup rcc_cifr CIFR Clock interrupt flag register
@{*/

