grevaillot/svd_tools/headers/STM32L4R7/rcc.h
/** @defgroup rcc_apb1smenr2 APB1SMENR2 APB1 peripheral clocks enable in Sleep and Stop modes register 2
@{*/

/** RCC_APB1SMENR2_LPTIM2SMEN LPTIM2SMEN **/
#define RCC_APB1SMENR2_LPTIM2SMEN		(1 << 5)
/** RCC_APB1SMENR2_I2C4SMEN I2C4 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR2_I2C4SMEN		(1 << 1)
/** RCC_APB1SMENR2_LPUART1SMEN Low power UART 1 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR2_LPUART1SMEN		(1 << 0)

/**@}*/

/** @defgroup rcc_apb2smenr APB2SMENR APB2SMENR
@{*/

/** RCC_APB2SMENR_DSISMEN DSI clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_DSISMEN		(1 << 27)
/** RCC_APB2SMENR_LTDCSMEN LCD-TFT timer clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_LTDCSMEN		(1 << 26)
/** RCC_APB2SMENR_DFSDM1SMEN DFSDM timer clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_DFSDM1SMEN		(1 << 24)
/** RCC_APB2SMENR_SAI2SMEN SAI2 clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_SAI2SMEN		(1 << 22)
/** RCC_APB2SMENR_SAI1SMEN SAI1 clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_SAI1SMEN		(1 << 21)
/** RCC_APB2SMENR_TIM17SMEN TIM17 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_TIM17SMEN		(1 << 18)
/** RCC_APB2SMENR_TIM16SMEN TIM16 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_TIM16SMEN		(1 << 17)
/** RCC_APB2SMENR_TIM15SMEN TIM15 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_TIM15SMEN		(1 << 16)
/** RCC_APB2SMENR_USART1SMEN USART1clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_USART1SMEN		(1 << 14)
/** RCC_APB2SMENR_TIM8SMEN TIM8 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_TIM8SMEN		(1 << 13)
/** RCC_APB2SMENR_SPI1SMEN SPI1 clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_SPI1SMEN		(1 << 12)
/** RCC_APB2SMENR_TIM1SMEN TIM1 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_TIM1SMEN		(1 << 11)
/** RCC_APB2SMENR_SYSCFGSMEN SYSCFG clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_SYSCFGSMEN		(1 << 0)

/**@}*/

/** @defgroup rcc_ccipr CCIPR CCIPR
@{*/


#define RCC_CCIPR_ADCSEL_SHIFT		28
#define RCC_CCIPR_ADCSEL_MASK		0x03
/** @defgroup rcc_ccipr_adcsel ADCSEL ADCs clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_CLK48SEL_SHIFT		26
#define RCC_CCIPR_CLK48SEL_MASK		0x03
/** @defgroup rcc_ccipr_clk48sel CLK48SEL 48 MHz clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_SAI2SEL_SHIFT		24
#define RCC_CCIPR_SAI2SEL_MASK		0x03
/** @defgroup rcc_ccipr_sai2sel SAI2SEL SAI2 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_SAI1SEL_SHIFT		22
#define RCC_CCIPR_SAI1SEL_MASK		0x03
/** @defgroup rcc_ccipr_sai1sel SAI1SEL SAI1 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_LPTIM2SEL_SHIFT		20
#define RCC_CCIPR_LPTIM2SEL_MASK		0x03
/** @defgroup rcc_ccipr_lptim2sel LPTIM2SEL Low power timer 2 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_LPTIM1SEL_SHIFT		18
#define RCC_CCIPR_LPTIM1SEL_MASK		0x03
/** @defgroup rcc_ccipr_lptim1sel LPTIM1SEL Low power timer 1 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_I2C3SEL_SHIFT		16
#define RCC_CCIPR_I2C3SEL_MASK		0x03
/** @defgroup rcc_ccipr_i2c3sel I2C3SEL I2C3 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_I2C2SEL_SHIFT		14
#define RCC_CCIPR_I2C2SEL_MASK		0x03
/** @defgroup rcc_ccipr_i2c2sel I2C2SEL I2C2 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_I2C1SEL_SHIFT		12
#define RCC_CCIPR_I2C1SEL_MASK		0x03
/** @defgroup rcc_ccipr_i2c1sel I2C1SEL I2C1 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_LPUART1SEL_SHIFT		10
#define RCC_CCIPR_LPUART1SEL_MASK		0x03
/** @defgroup rcc_ccipr_lpuart1sel LPUART1SEL LPUART1 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_UART5SEL_SHIFT		8
#define RCC_CCIPR_UART5SEL_MASK		0x03
/** @defgroup rcc_ccipr_uart5sel UART5SEL UART5 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_UART4SEL_SHIFT		6
#define RCC_CCIPR_UART4SEL_MASK		0x03
/** @defgroup rcc_ccipr_uart4sel UART4SEL UART4 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_USART3SEL_SHIFT		4
#define RCC_CCIPR_USART3SEL_MASK		0x03
/** @defgroup rcc_ccipr_usart3sel USART3SEL USART3 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_USART2SEL_SHIFT		2
#define RCC_CCIPR_USART2SEL_MASK		0x03
/** @defgroup rcc_ccipr_usart2sel USART2SEL USART2 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_USART1SEL_SHIFT		0
#define RCC_CCIPR_USART1SEL_MASK		0x03
/** @defgroup rcc_ccipr_usart1sel USART1SEL USART1 clock source selection
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_bdcr BDCR BDCR
@{*/

/** RCC_BDCR_LSCOSEL Low speed clock output selection **/
#define RCC_BDCR_LSCOSEL		(1 << 25)
/** RCC_BDCR_LSCOEN Low speed clock output enable **/
#define RCC_BDCR_LSCOEN		(1 << 24)
/** RCC_BDCR_BDRST Backup domain software reset **/
#define RCC_BDCR_BDRST		(1 << 16)
/** RCC_BDCR_RTCEN RTC clock enable **/
#define RCC_BDCR_RTCEN		(1 << 15)

#define RCC_BDCR_RTCSEL_SHIFT		8
#define RCC_BDCR_RTCSEL_MASK		0x03
/** @defgroup rcc_bdcr_rtcsel RTCSEL RTC clock source selection
@{*/
/**@}*/

/** RCC_BDCR_LSECSSD LSECSSD **/
#define RCC_BDCR_LSECSSD		(1 << 6)
/** RCC_BDCR_LSECSSON LSECSSON **/
#define RCC_BDCR_LSECSSON		(1 << 5)

#define RCC_BDCR_LSEDRV_SHIFT		3
#define RCC_BDCR_LSEDRV_MASK		0x03
/** @defgroup rcc_bdcr_lsedrv LSEDRV SE oscillator drive capability
@{*/
/**@}*/

/** RCC_BDCR_LSEBYP LSE oscillator bypass **/
#define RCC_BDCR_LSEBYP		(1 << 2)
/** RCC_BDCR_LSERDY LSE oscillator ready **/
#define RCC_BDCR_LSERDY		(1 << 1)
/** RCC_BDCR_LSEON LSE oscillator enable **/
#define RCC_BDCR_LSEON		(1 << 0)

/**@}*/

/** @defgroup rcc_csr CSR CSR
@{*/

/** RCC_CSR_LPWRSTF Low-power reset flag **/
#define RCC_CSR_LPWRSTF		(1 << 31)
/** RCC_CSR_WWDGRSTF Window watchdog reset flag **/
#define RCC_CSR_WWDGRSTF		(1 << 30)
/** RCC_CSR_IWDGRSTF Independent window watchdog reset flag **/
#define RCC_CSR_IWDGRSTF		(1 << 29)
/** RCC_CSR_SFTRSTF Software reset flag **/
#define RCC_CSR_SFTRSTF		(1 << 28)
/** RCC_CSR_BORRSTF BOR flag **/
#define RCC_CSR_BORRSTF		(1 << 27)
/** RCC_CSR_PINRSTF Pin reset flag **/
#define RCC_CSR_PINRSTF		(1 << 26)
/** RCC_CSR_OBLRSTF Option byte loader reset flag **/
#define RCC_CSR_OBLRSTF		(1 << 25)
/** RCC_CSR_FWRSTF Firewall reset flag **/
#define RCC_CSR_FWRSTF		(1 << 24)
/** RCC_CSR_RMVF Remove reset flag **/
#define RCC_CSR_RMVF		(1 << 23)

#define RCC_CSR_MSISRANGE_SHIFT		8
#define RCC_CSR_MSISRANGE_MASK		0x0f
/** @defgroup rcc_csr_msisrange MSISRANGE SI range after Standby mode
@{*/
/**@}*/

/** RCC_CSR_LSIRDY LSI oscillator ready **/
#define RCC_CSR_LSIRDY		(1 << 1)
/** RCC_CSR_LSION LSI oscillator enable **/
#define RCC_CSR_LSION		(1 << 0)

/**@}*/

/** @defgroup rcc_crrcr CRRCR Clock recovery RC register
@{*/


#define RCC_CRRCR_HSI48CAL_SHIFT		7
#define RCC_CRRCR_HSI48CAL_MASK		0x1ff
/** @defgroup rcc_crrcr_hsi48cal HSI48CAL HSI48 clock calibration
@{*/
/**@}*/

/** RCC_CRRCR_HSI48RDY HSI48 clock ready flag **/
#define RCC_CRRCR_HSI48RDY		(1 << 1)
/** RCC_CRRCR_HSI48ON HSI48 clock enable **/
#define RCC_CRRCR_HSI48ON		(1 << 0)

/**@}*/

/** @defgroup rcc_ccipr2 CCIPR2 Peripherals independent clock configuration register
@{*/


#define RCC_CCIPR2_OSPISEL_SHIFT		20
#define RCC_CCIPR2_OSPISEL_MASK		0x03
/** @defgroup rcc_ccipr2_ospisel OSPISEL Octospi clock source selection
@{*/
/**@}*/


#define RCC_CCIPR2_PLLSAI2DIVR_SHIFT		16
#define RCC_CCIPR2_PLLSAI2DIVR_MASK		0x03
/** @defgroup rcc_ccipr2_pllsai2divr PLLSAI2DIVR division factor for LTDC clock
@{*/
/**@}*/

/** RCC_CCIPR2_SDMMCSEL SDMMC clock selection **/
#define RCC_CCIPR2_SDMMCSEL		(1 << 14)
/** RCC_CCIPR2_DSISEL clock selection **/
#define RCC_CCIPR2_DSISEL		(1 << 12)

#define RCC_CCIPR2_SAI2SEL_SHIFT		8
#define RCC_CCIPR2_SAI2SEL_MASK		0x07
/** @defgroup rcc_ccipr2_sai2sel SAI2SEL SAI2 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR2_SAI1SEL_SHIFT		5
#define RCC_CCIPR2_SAI1SEL_MASK		0x07
/** @defgroup rcc_ccipr2_sai1sel SAI1SEL SAI1 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR2_ADFSDMSEL_SHIFT		3
#define RCC_CCIPR2_ADFSDMSEL_MASK		0x03
/** @defgroup rcc_ccipr2_adfsdmsel ADFSDMSEL Digital filter for sigma delta modulator audio clock source selection
@{*/
/**@}*/

/** RCC_CCIPR2_DFSDMSEL Digital filter for sigma delta modulator kernel clock source selection **/
#define RCC_CCIPR2_DFSDMSEL		(1 << 2)

#define RCC_CCIPR2_I2C4SEL_SHIFT		0
#define RCC_CCIPR2_I2C4SEL_MASK		0x03
/** @defgroup rcc_ccipr2_i2c4sel I2C4SEL I2C4 clock source selection
@{*/
/**@}*/


/**@}*/
